title: Mitre T1218.010 - Signed Binary Proxy Execution - Regsvr32
status: experimental
description: Detects code-execution using REGSVR32.exe connecting to web server
references:
    - Internal Research
date: 2020/08/19
tags:
    - T1218.010
author: Luk Schoonaert
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        ProcessName:
            - 'regsvr32.exe'
        CommandLine:
            - 'scrobj.dll'
            - '*i:http*'
            - '*i:https*'
    condition: selection
falsepositives:
    - Unkown
level: critical
