title: .NET Injection
status: experimental
description: Detects .NET clr being loaded into a process (execute-assembly)
author: Luk Schoonaert
references:
    - https://
tags:
    - .Net
    - Process Injection
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 7
        OriginalFileName: 
          - 'clr.dll'
          - 'mscoree.dll'        
    whitelist:
        EventID: 7
        ProcessName: 
         - 'LocalBridge.exe'
         - 'backgroundTaskHost.exe'   
         - 'mmc.exe'
         - 'msiexec.exe'
         - 'mscorsvw.exe' #dotnet Framework
         - 'ngen.exe' #dotnet Framework
         - 'taskhostw.exe'
         - 'ngentask.exe'
    condition: selection AND NOT whitelist
falsepositives:
    - unknown
level: high

